Revit 2027 API
LoadBase.LoadNatureName Property
 A string representing the nature of the load.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string LoadNatureName { get; }
Public ReadOnly Property LoadNatureName As String
	Get
public:
property String^ LoadNatureName {
	String^ get ();
}
member LoadNatureName : string with get
Property Value
String
See Also
Reference
LoadBase Class
Autodesk.Revit.DB.Structure Namespace